Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=1084_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: " Hirviöräppiä " inarinsaameksi
sme: " Balddonasrap " anárašgillii

source: Saameräpin isä Amoc räppää uhanalaisella inarinsaamella, jonka puhujia on nykyään arviolta 350-450.
sme: Sáme-rap áhčči, Amoc nappo Mikkal Morottaja, ráppe áitatvuloš anárašgielain, man hubmit gávdnojit dán áigge sullii 350-450.

source: Kieli on elpynyt viimeisten kahdenkymmenen vuoden aikana erityisesti kielipesätoiminnan ansiosta, jonka laittoi Mikkalin isä Matti Morottaja taannoin käyntiin.
sme: Anárašgiella lea ealáskan maŋimus guovttelot jagi siste erenoamážit giellabeassedoaimmaid geažil, maid bijai johtui Mikkala áhčči Matti Morottaja.

source: Amocia on kutsuttu inarinsaamen lähettilääksi, mutta itse hän painottaa, että on vain yksi tekijä muiden kielen eteen työskentelevien joukossa.
sme: Amoca leat gohčodan anáraččaid sáttaolmmožin, muhto ieš son deattuha, ahte leat maid eará olbmot geat barget sin giela ovdii.

source: Inarinsaameksi Amoc alkoi räpätä ensin kokeilumielessä, mutta koska se on hänen äidinkielensä, niin se oli myös luonnollista.
sme: Mikkal ráppegođii anárašgillii go hálidii geahččaladdat mo dat doaibmá.

source: Amoc kokee musiikin tekemisen ja kirjoittamisen lähtökohtaisesti terapiatyönä.
sme: Ráppen iežas eatnigillii oruinai hui lunddolaš.

source: Inarinsaamenkielen käyttö ja kehittäminen siinä samalla on hienoa bonusta.
sme: Musihka ráhkadeapmi ja čállin leat sutnje álgoálggus terapiija.

source: Amoc keikalla Taiga Festivalilla 2015 Tankavaarassa.
sme: Seammas son beassá geavahit ja ovddidit anárašgiela, mii leage fiinna bonus.

source: Kun suomiräp nousi 90-luvun lopulla suosioon, Mikkalkin innostui siitä, koska se oli tavallaan helppo musiikkimuoto.
sme: Dalle go suopmarap šattai bivnnuhin 90-logu loahpas, movttáskii Mikkalnai dasa go rap orui leame muhtin ládje álkes musihkkastiila.

source: Hän kiinnostui erityisesti sanoilla leikkimisestä ja teknisestä räpistä, kaikesta siitä mitä riimeillä voi saada aikaan.
sme: Sus lei erenomážit beroštupmi teknihkalaš ráppemii ja sániiguin stoahkamii, ja dasa maid ihkenassii sáhttá riimmain duddjot.

source: Amoc on itse kuvannut musiikkiaan joskus ympäripyöreästi ” hirviöräpiksi ” ja sitä on havaittavissa joidenkin kappaleiden tarinoinnissa.
sme: Amoc ieš lea govvidan musihkkis ” balddonasrap ” - sániin, ja dakkár dovdamuš vuhtto soames bihtáin.

source: Raskaan räpin lisäksi Amocin tuotannosta löytyy myös tunteisiin vetoavia kappaleita.
sme: Losses rap lassin Amoc lea goittotge ráhkadan maid lávlagiid mat váldet dovdduide.

source: Amoc käyttää teksteissään paljon vertauksia eikä tee perinteistä iskulinjaräppiä.
sme: Amoc geavaha teavsttainis ollu veardádusaid iige ráhkat nu gohčoduvvon punch-line-rap.

source: Teemoihin hän toisinaan löytää inspiraation saamelaisesta mytologiasta.
sme: Temáide son muhtumin gávdná inspirašuvnna sámi mytologiijas.

source: Muutoin saamelaisuus näkyy Amocin musiikissa tekijän saamelaisuuden lisäksi tekstien saamenkielisyytenä.
sme: Dan lassin ahte Mikkal lea sápmelaš ja čállá sámegillii de ii sámevuohta muđui jur dihtto su musihkas.

source: Biittien suhteen hänellä on globaali maku, Mikkal ei ole yrittänyt tuoda esimerkiksi soitinmaailman kautta saamelaisuutta biitteihin.
sme: Amoc liiko globála duogášritmmaide iige leat iskan buktit sámevuođa ovdan vaikkoba čuojanasaid bokte.

source: Toisaalta on toissijaista eritellä mikä kappaleissa on saamelaista ja mikä ei.
sme: Nuppe dáfus lea dušši suokkardit mii bihtáin lea sápmelaš ja mii fas ii.

source: Amocin itsensä mielestä saamelaisen musiikin määritteeksi riittää, että tekijä on saamelainen.
sme: Amoca mielas sámemusihka dovdá das, ahte dahkki lea sápmelaš.

source: Mikkalin musiikkirintamalle kuuluu tällä hetkellä hyvää.
sme: Mikkala musihkkaeallimis manná dál bures.

source: Amoc on alkanut keikkailla nyt myös bändin kanssa, mikä tuo uuden mielenkiintoisen lisän live-meininkiin.
sme: Amoc lea dahkagoahtán konsearttaid dál maid ovttas čuojaheaddjiiguin, mii mielddisbuktá ođđa fámuid loaiddasteapmái.

source: Bändin kanssa Amoc esiintyy muun muassa Riddu Riđđu – alkuperäiskansafestivaaleilla 2015 Pohjois-Norjassa.
sme: Joavkkuin Amoc loaiddasta earret eará Riddu Riđđu – álgoálbmotfestiválain 2015 Davvi-Norggas.

source: Siellä pidetään myös Inger-Mari Aikio-Arianaickin ohjaaman “ Amoc – Vuosmuš ” - dokumenttifilmin ensi-ilta.
sme: Doppe lea maiddái Inger-Mari Aikio bagadallan filmma ” Amoc – vuosmuš ” vuosttašeahket.

source: Lisäksi kesällä 2015 ilmestyy Amocin toinen albumi, joka kulkee työnimellä Faabelit.
sme: Dan lassin Amocis almmustuvvá geasset 2015 su nubbi album, mii lea johtán bargonamain Faabelit.

source: Uudella levyllä on Mikkalin itsensä mukaan ensimmäiseen täyspitkään Amok-kaččâm - levyyn verrattuna mustan huumorin lisäksi enemmän pilkettä.
sme: Mikkala mielas jos veardida ođđa skearru vuosttas skerrui, de das lea čáhppes humora lassin goittot eambbo illu vaikko livččiinai vehá čihkosis.

source: Uusi levv on monimuotoinen ja sieltä löytyy jopa yksi metallibiisi.
sme: Ođđa album lea máŋggabealat ja doppe gávdno maid akta metállalávlla.

source: Tekstillisesti uusi levy on tarinallinen. Se sisältää näkemyksiä tulevaisuuteen sekä muutaman henkilökohtaisemman kappaleen.
sme: Tevsttalaččat ođđa skearru lea máinnaslaš ja sisttisdoallá oainnuid boahttevuhtii sihke moadde persovnnalaš bihtá.

source: Lyriikoista löytyy metaforia, jotka viittaavat yhteiskunnallisiin ongelmiin globaalilla tasolla. Muuten Amocia ei saarnaaminen kiinnosta eikä hän halua ottaa kantaa politiikkaan.
sme: Lyriihkain gávdnojit metaforat, mat čujuhit servodatlaš čuolmmaide máilmmi dásis, muhto muđui son ii leat beroštuvvan sárdnut iige son hálit dahkat politihka.

source: - Minulla ei ole taka-ajatuksena vaikuttaa ihmisten ajatuksiin, sanoo Mikkal.
sme: - Mus ii leat áigumuš váikkuhit olbmuid jurdagiidda, dadjá Mikkal.

source: - Päällimmäinen tarkoitus on tehdä viihdetaidetta itselle ja kavereille, ja jos muutkin ihmiset haluavat kuunnella, niin se on vain hyvä asia.
sme: - Vuođđojurdda lea beare dahkat suohttasatdáidaga alccen ja skihpáriidda, ja jos earánai olbmot hálidit guldalit nu dat lea beare buorre ášši.

source: Linkkejä:
sme: Liŋkkat:
